["... <b>Legal</b> gambling is taxed and regulated and illegal gambling is <b>not</b>. <b>Legal</b> <br>\ngambling sets the stage for illegal gambling just the way <b>legal marijuana</b> would <br>\nset the stage for illegal <b>marijuana</b> trafficking. The gambling precedent suggests <br>\nstrongly that illegal drug suppliers would thrive by selling more potent&nbsp;...", "... Amsterdam is the most famous place across the world that has effectively <br>\n<b>legalized</b> pot. It has even turned into a tourist destination for potheads. Legalizing <br>\n<b>weed</b> has been a huge success there, right? Actually, <b>not</b> so much... Its citizens <br>\nare now alarmed that their children are increasingly being exposed to it&nbsp;...", "... Regarding <b>marijuana</b> use or any moral question, arguing right and wrong in <br>\ntoday&#39;s society is especially difficult because a growing number of people reject <br>\nabsolute right and wrong. Producing a documentary titled Get Out of the Matrix, <br>\nour video crew walked onto a college campus and asked random&nbsp;...", "... America just took three steps toward nationally <b>legal marijuana</b>: Oregon, Alaska, <br>\nand D.C. <b>Should</b> we be lighting up a celebratory doobie? ... School of Medicine <br>\npublished in the journal Neuropsychopharmacology found that “Regular <br>\n<b>marijuana</b> use during adolescence, but <b>not</b> adulthood, may permanently&nbsp;...", "There is <b>not</b> enough support to use <b>marijuana</b> or <b>cannabis</b> medically in in the <br>\nAmerica and across the globe. There has been lots of debating about whether <br>\n<b>marijuana should</b> be <b>legalized</b> or <b>not</b>. Below are 10 powerful reasons which <br>\nexplain why <b>marijuana should</b> never be <b>legalized</b>.", "... In such circumstances, when there is an intelligible good to be served by <br>\ningesting <b>marijuana</b> and there are no defeating reasons <b>not</b> to do so—<br>\nconsequences of use, side effects, effects on others, availability of other less <br>\nproblematic forms of medical treatment for the health problem in question, <b>legal</b> <br>\nstatus&nbsp;...", "This unquestionably happens in some cases. But it also happens with alcohol, <br>\nwhich is perfectly <b>legal</b>. In order to fight this argument for prohibition, legalization <br>\nadvocates have made the argument that <b>marijuana</b> is <b>not</b> as addictive as <br>\ngovernment sources claim. So how addictive is <b>marijuana</b> after all? The truth is <br>\nwe really&nbsp;...", "Would you want to raise a family as your child gets swayed to use this harmful <br>\nsubstance at school since their are no rules (Amsterdam also had problems with <br>\na majority of its high school students coming to school high and flunking)? <br>\n<b>Cannabis should not be legal</b>, it needs to remain illegal for the greater good. <br>\nReport Post.", "... Today, the country&#39;s most prominent group of pediatricians issued a policy <br>\nstatement that opposes <b>marijuana</b> legalization and advocates for policies to help.", "<b>Marijuana</b> Use Would Increase. According to a study (Melanie Wall, et al.) <br>\ncomparing data from the National Survey on Drug Use and Health from 200-2008<br>\n, states that have <b>legalized marijuana</b> under the guise of medicine have higher <br>\n<b>marijuana</b> use rates by youth aged 12-17 compared to other states. <b>Marijuana</b> is <br>\nthe&nbsp;...", "... Top 10 Reasons Medical <b>Marijuana Should Be Illegal</b>. Marijuana is a funny drug. <br>\nClassified alongside Narcotics as a Schedule I drug in the USA some other <br>\ncountries take a softer line on possession and use (although not, necessarily, on <br>\ndealing). Despite a Supreme Court ruling stating that the federal&nbsp;...", "<b>Marijuana should not be legalized</b> essay - Instead of wasting time in <br>\nunproductive attempts, get professional help here professional and cheap paper <br>\nto simplify your education Making a custom research paper means go through <br>\nlots of stages.", "... The Only Way to Win Argument Against <b>Marijuana</b> (Don&#39;t let the other person talk) <br>\n- Duration: 9:54. Ronpaulcarflags 82,202 views &middot; 9:54 &middot; <b>Marijuana</b> Legalization <br>\nDebate (Part 1) -- The Doctors - Duration: 3:44. The Doctors 136,212 views &middot; 3:44. <br>\nWhat Will Recreational <b>Marijuana</b> Legalization Mean for&nbsp;...", "<b>Marijuana should not be legalized</b> essay - Get an A+ grade even for the hardest <br>\nassignments. Find out everything you have always wanted to know about custom <br>\nwriting Enjoy the advantages of qualified writing help available here.", "In the following viewpoint, Antonio Maria Costa argues that <b>marijuana</b> is <br>\nportrayed falsely as a harmless substance that <b>should</b> be <b>legalized</b>. In contrast, <br>\nCosta claims that <b>marijuana&#39;s</b> potential harms justify strict control of the substance<br>\n. Costa claims that stricter policies and enforcement of laws can eliminate many <br>\nof the&nbsp;...", "... A slim majority (53%) of Americans say the drug <b>should</b> be made <b>legal</b>, <br>\ncompared with 44% who want it to <b>be illegal</b>. Opinions have changed drastically <br>\nsince 1969, when Gallup first asked the question and found that just 12% favored <br>\nlegalizing <b>marijuana</b> use. Much of the change in opinion has occurred&nbsp;...", "... This November, voters in Massachusetts will be asked whether to legalize <br>\n<b>marijuana</b>. Our state has already decriminalized the drug for personal use, and <br>\nwe&#39;ve made it <b>legally</b> available for medical use. The question before us now is <br>\nwhether <b>marijuana should</b> be fully <b>legal</b> and widely available for&nbsp;...", "... Hundreds of thousands of youth have been arrested or put in jail for using <br>\n<b>marijuana</b>. Having a criminal record can make it hard or impossible to get college <br>\nloans, financial aid, housing, and certain kinds of jobs. While the AAP does <b>not</b> <br>\nbelieve that <b>marijuana</b> use <b>should</b> be <b>legal</b>, it does believe that it&nbsp;...", "Legalizing <b>Marijuana</b>: Why Citizens <b>Should</b> Just Say No. September 13, 2010 26 <br>\nmin read Download Report. CullyStimson. Charles Stimson &middot; @cullystimson. <br>\nChief of Staff and Senior <b>Legal</b> Fellow. Charles “Cully” Stimson is a widely <br>\nrecognized expert in national security, homeland security, crime control, drug <br>\npolicy &amp;&nbsp;...", "... About one-in-five opponents of legalization (19%) say marijuana is illegal and <br>\nneeds to be policed, 11% say it is a gateway to harder drugs and 8% say it is <br>\nespecially harmful to young people. A small share of opponents (7%) say that <br>\nwhile the recreational use of <b>marijuana should be illegal</b>, they do not&nbsp;...", "RT @jyggzzy: (contd) marijuana should be legal in Nigeria too since it's legal in some other countries. That's not the way. Then again, if…", "(contd) marijuana should be legal in Nigeria too since it's legal in some other countries. That's not the way. Then… https://t.co/nBWgZVx7QQ", "@dandakich Great example of why marijuana should be legal.  Always calm, not resisting arrest.  Of course you shoul… https://t.co/FutO0eM7iS", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "@RoKhanna Well, I agree on the point about them claiming to be for states rights yet doing this. and I agree that m… https://t.co/NmryJF1bjG", "RT JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil li… https://t.co/NbiE6EbZtB", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "RT @JodieEmery: Marijuana should be legal because criminalizing people for it is unjust. It should be about civil liberties, not new prohib…", "Even Oklahoma is getting on board. No way alcohol should be legal but not marijuana. Also drug abuse is a public he… https://t.co/UuY3TCXQ4A", "@LivingHisLight @Spacekatgal Those who wish to use marijuana will use it wether it's legal or not, by legalizing it… https://t.co/HBncEpHLbE", "@realDonaldTrump If you’d like to quickly and substantially lower debt AND go up in the polls you could legalize an… https://t.co/K3vBld1rai"]