["When science fiction writers started to predict that robots would someday take <br>\nover many of the jobs that human workers do, they probably didn&#39;t realize that.", "... The study focuses on the impact of robotics <b>automation</b> on <b>economic</b> <br>\ndevelopment from 1993 to 2015. It includes 23 countries that are part of the <br>\nOECD (Organisation for <b>Economic</b> Co-operation and Development), a group of <br>\ncountries with highly developed economies and democratic governments.", "... That would enable us to very rapidly construct houses and other buildings in an <br>\nalmost completely <b>automated</b> fashion. It would also potentially threaten millions <br>\nof construction jobs. Surely, total <b>automation</b> is a <b>good</b> thing; Karl Marx said, <br>\npeople will have more free time, which will “redound to the benefit of&nbsp;...", "... <b>Automation</b> leads to significant economies of scale – important in industries <br>\nwhich require high capital investment. <b>Automation</b> enables firms to reduce <br>\nnumber of workers, and this limits the power of trades unions and potentially <br>\ndisruptive strikes. <b>Automation</b> also enables a greater <b>economy</b> of scope.", "... All those dire predictions about the <b>automated economy</b> sound like a sci-fi horror <br>\nfilm from the &#39;50s: Robots are coming to take your jobs, your homes, .... Its value, <br>\nCEO Marc Benioff said at the launch, will be in “helping people do the things that <br>\npeople are <b>good</b> at and turning more things over to machines.”.", "... What determines vulnerability to <b>automation</b>, experts say, is not so much whether <br>\nthe work concerned is manual or white-collar but whether or not it is .... Those <br>\nsounding warnings about technological unemployment “basically ignore the <br>\nissue of the <b>economic</b> response to <b>automation</b>”, says Mr Bessen.", "... Editor&#39;s Note: Staff from the Council of <b>Economic</b> Advisers, the Domestic Policy <br>\nCouncil, the National <b>Economic</b> Council, the Office of Management and Budget, <br>\nthe Office of Science and Technology Policy contributed to this post. Today, in <br>\norder to ready the United States for a future in which artificial&nbsp;...", "Classic example is introduction of washing machines in the developing world, <br>\nallowing women and girls to escape the time-consuming and laborious process <br>\nof hand washing, opening time up for other activities. &gt; And what&#39;s the magic with <br>\nthem? My mo...", "... Whether you believe the impact of <b>automation</b> is overhyped or you&#39;re preparing to <br>\nwelcome our new robot overlords, there is no denying that the modern workplace <br>\nis evolving. The integration of robotic <b>automation</b> is one of several key trends <br>\nreshaping the U.S. <b>economy</b>, and it&#39;s important that we have an&nbsp;...", "... Reprinted from the Freeman. Will workplace <b>automation</b> make the rich richer and <br>\ndoom the poor? That could happen soon, warns Paul Solman, <b>economics</b> <br>\ncorrespondent for PBS NewsHour. He&#39;s talking to Jerry Kaplan, author of a new <br>\nbook that seems to combine Luddism with fears about inequality.", "... Rather than a threat, the rise of more intelligent machines represents an <br>\nopportunity to disrupt the <b>economic</b> status quo through <b>automation</b>.", "... Artificial Intelligence is a key topic at this year&#39;s World <b>Economic</b> Forum Annual <br>\nMeeting. Watch the Artificial Intelligence session here. Artificial intelligence and <br>\nincreasing <b>automation</b> is going to decimate middle class jobs, worsening <br>\ninequality and risking significant political upheaval, Stephen Hawking has&nbsp;...", "... This issue brief provides emerging analysis on the challenges and opportunities <br>\nfor business to create and preserve <b>good</b> jobs during an era of rapid <br>\ntechnological change. ... You Might Also Like. Audrey Choi Emphasizes Need for <br>\nBusiness Action for an Inclusive <b>Economy</b> at the BSR Conference 2017&nbsp;...", "... has fully robotic and <b>automated</b> assembly lines for its electric cars and batteries. <br>\nRobots are even being used in therapy sessions for children. While it is certainly <br>\ntrue that robots are replacing jobs and are a significant threat to low-skilled <br>\nworkers and somewhat of a threat to middle-skilled workers, there are&nbsp;...", "The modern <b>economy</b> was built on <b>automation</b>, so it&#39;s natural to assume that the <br>\nfuture will be defined by <b>automation</b> as well. It seems like every week there&#39;s a <br>\nnew study or think piece about the job-destroying potential of robotics and <br>\nartificial intelligence. But our collective obsession with job-stealing robots can <br>\ncause us to&nbsp;...", "... <b>Automation</b> is blocking the primary route for poor countries to grow rich. ... <br>\n<b>Automation</b> will end the dream of rapid <b>economic</b> growth for poorer countries .... <br>\nrenewable energy, makes the circular <b>economy</b> work (the informal <b>economy&#39;s</b> <br>\nwaste pickers tend to be pretty <b>good</b> at this) and manages landscapes that&nbsp;...", "... Stream The Wake Up Call Podcast - Why <b>Automation Is Good for the Economy</b> <br>\nwith Dr. Per Bylund by Liberty.me Studio from desktop or your mobile device.", "... In 2013, Oxford economist Carl Frey and Machine Learning expert Michael <br>\nOsborne found that there is a high chance that engineers will find ways to <br>\n<b>automate</b> 47% of jobs in the United States, possibly within “a decade or two”.i <br>\nWhat is significant about their findings is that unlike previous technological&nbsp;...", "... 24/02/2017. Robotics. With driverless cars now a reality and robots taking over <br>\nmany jobs (and not only menial jobs) how should we view this. Threat or <br>\nopportunity? Jamal Harwood delivers <b>economic</b> analysis on current events, and <br>\nissues around the world. Broadcasting live on facebook every Tues and&nbsp;...", "... Is this just part of a larger “digital transformation” of our entire <b>economy</b> that will <br>\nrender human workers increasingly obsolete, even in jobs that up to now have <br>\nseemed necessarily “human intensive”? Or is it an example of how human <br>\nservices can increasingly leverage technology to provide even higher&nbsp;...", "@MeetThePress @ChrisVanHollen What do you mean? Corporations are going to invest which should be good for the econo… https://t.co/QjAXsR6Nsi", "RT @enateLtd: #Robotics and #automation are good for productivity growth and the UK economy, which is why we need to take advantage of them…", "Astounding: \"Half of job seekers (50%) say the introduction of the Internet has generally done more harm than good.… https://t.co/TPlfFbpgYC", "#Robotics and #automation are good for productivity growth and the UK economy, which is why we need to take advanta… https://t.co/GIwGY7lDdp"]