["... <b>Legal</b> gambling is taxed and regulated and illegal gambling is <b>not</b>. <b>Legal</b> <br>\ngambling sets the stage for illegal gambling just the way <b>legal marijuana</b> would <br>\nset the stage for illegal <b>marijuana</b> trafficking. The gambling precedent suggests <br>\nstrongly that illegal <b>drug</b> suppliers would thrive by selling more potent&nbsp;...", "Opponents of <b>medical marijuana</b> argue that it is too dangerous to use, lacks FDA-<br>\napproval, and that various <b>legal drugs</b> make <b>marijuana</b> use unnecessary. They <br>\nsay ... nonprofit website that presents research, studies, and pro and con <br>\nstatements on questions related to whether or <b>not marijuana should</b> be a <b>medical</b> <br>\noption.", "... CHICAGO — Illinois <b>should not</b> legalize <b>cannabis</b>, and physicians <b>should not</b> <br>\nwrite recommendations for patients to use <b>marijuana</b> for <b>medical</b> purposes, <br>\nbecause it is a dangerous, addictive <b>drug</b> and is <b>not</b> approved by the US Food <br>\nand <b>Drug</b> Administration (FDA), a group of addiction <b>medicine</b> physicians&nbsp;...", "... Top 10 Reasons <b>Medical Marijuana Should Be Illegal</b>. <b>Marijuana</b> is a funny <b>drug</b>. <br>\nClassified alongside Narcotics as a Schedule I <b>drug</b> in the USA some other <br>\ncountries take a softer line on possession and use (although <b>not</b>, necessarily, on <br>\ndealing). Despite a Supreme Court ruling stating that the federal&nbsp;...", "... She strongly suggests she will <b>not</b> stop using the <b>drug</b>. With 28 million Americans <br>\nusing <b>marijuana</b> primarily for personal recreational use, <b>should</b> the sick, disabled <br>\nand dying be subject to the same penalties of the <b>law</b>? <b>Should</b> they be arrested, <br>\nhave their <b>marijuana</b> plants destroyed, pay large fines?", "... &quot;Of the 7.3 million persons aged 12 or older classified with illicit <b>drug</b> <br>\ndependence or abuse in 2012, 4.3 million persons had <b>marijuana</b> dependence <br>\nor abuse.&quot; It doesn&#39;t take a rocket scientist to figure out that the more <b>legal</b> and <br>\navailable <b>marijuana</b> becomes, the higher those numbers are going to go.", "The new survey also finds that as some states have <b>legalized marijuana</b> – <br>\nplacing them at odds with the federal prohibition against <b>marijuana</b> – a majority of <br>\nAmericans (59%) say that the federal government <b>should not</b> enforce <b>laws</b> in <br>\nstates that allow&nbsp;...", "... Firstly, I am <b>not</b> arguing that <b>medical marijuana should</b> never be <b>legalized</b>. I am <br>\narguing that it <b>should not be legalized</b> yet. Argument 1: Safety Concerns. Many <br>\nstudies have indicated that <b>marijuana</b> has <b>no</b> safety issues and some even claim <br>\nit is healthy. <b>Not</b> every study agrees though. Some indicate major&nbsp;...", "... Pot <b>should</b> remain as a controlled substance, with <b>marijuana</b>-based <b>medicines</b> (<br>\nlike cocaine-based <b>medicines</b>) available by subscription fulfilled <b>not</b> from your <br>\nhome-grown stash but through a pharmacy. Why? It&#39;s wrong to get high. For in <br>\ndoing so you reject the counsel of the God who made you. And by&nbsp;...", "... <b>Marijuana</b> is a Schedule I <b>drug</b>, defined as having a high potential for abuse and <br>\n<b>no</b> accepted <b>medical</b> use, even though more than half the states have <b>legalized</b> <br>\n<b>medical marijuana</b>. It remains Schedule I, according to the DEA, because the <br>\nFDA has <b>not</b> yet approved any <b>marijuana</b> therapy.", "With the major and ongoing controversy of the legalization of <b>marijuana</b>, <b>medical</b> <br>\n<b>marijuana</b> has been thrown into the limelight as an excuse as to <b>why marijuana</b> is <br>\n“good.” But with <b>medical marijuana&#39;s</b> supposed advancements, more and more <br>\ndoctors are prescribing it to anyone who claims to have a headache and now&nbsp;...", "... teen smoking Today, the country&#39;s most prominent group of pediatricians issued <br>\na policy statement that opposes <b>marijuana</b> legalization and advocates for policies <br>\nto help minimize the <b>drug&#39;s</b> harmful effects on children and adolescents. The new <br>\nstatement, from the American Academy of Pediatrics, was&nbsp;...", "... While the AAP does <b>not</b> believe that <b>marijuana</b> use <b>should</b> be <b>legal</b>, it does <br>\nbelieve that it <b>should</b> be decriminalized so that penalties for <b>marijuana</b>-related <br>\noffenses are reduced to lesser criminal charges or civil penalties. Our efforts <br>\n<b>should</b> go into prevention and <b>treatment</b>, <b>not</b> locking kids up; we want to&nbsp;...", "Another reason &quot;<b>Why marijuana should not be legalized</b>?&quot; is that legalization <br>\nmay increase its abuse. The most widely used <b>drugs</b> in society are <b>legal</b> ones. <br>\nAlcohol is perhaps the most common, with cigarettes being a close second, <br>\n<b>marijuana</b> being the third most widely used recreational <b>drug</b>. The legalization of <br>\n<b>cannabis</b>&nbsp;...", "They must <b>not</b> lose sight of the fact that illicit <b>drugs</b> are dangerous—that is why <br>\nthe world agreed to restrict them. The global <b>cannabis</b> market is changing. <br>\nTraditional suppliers to the UK such as Morocco—the world&#39;s largest producer of <br>\n<b>cannabis</b> resin—are&nbsp;...", "... They may even concede: smoking <b>marijuana</b> to get high is always wrong, as is <br>\ndrinking to get drunk, but <b>marijuana should not be banned</b> because one can <br>\nsmoke <b>marijuana</b> for other reasons. By prohibiting <b>marijuana</b>, they argue, one is <br>\nunfairly targeting reasonable uses of the <b>drug</b> and infringing on&nbsp;...", "... It <b>should</b> come as <b>no</b> surprise that the vast majority of heroin users have used <br>\n<b>marijuana</b> (and many other <b>drugs</b>) <b>not</b> only long before they used heroin but <br>\nwhile they are ... Establishing it as a third <b>legal drug</b>, along with tobacco and <br>\nalcohol, will increase <b>drug</b> abuse, including the expanding opioid epidemic.", "... Since there&#39;s <b>no</b> science to back it up, the FDA has <b>not</b> approved smoked or <br>\nvaporized <b>marijuana</b> for the <b>treatment</b> of any <b>medical</b> condition. The FDA only <br>\napproves <b>medicines</b> when large ..... do <b>marijuana</b> if you have pain and suffering? <br>\nIf theirs help you <b>should</b> take <b>marijuana not</b> suffer because its <b>not legal</b>.", "While Colorado <b>legalized</b> recreational use of <b>marijuana</b>, states like California, <br>\nwho attempted to limit <b>marijuana</b> use to a <b>medical</b> purpose, have seen their <br>\nsystem abused by <b>marijuana</b> users who access dispensaries for recreational use. <br>\nIn spite of ... For this reason, <b>marijuana should not</b> receive special <b>treatment</b>. Just <br>\nlike&nbsp;...", "Legalizing <b>Marijuana</b>: Why Citizens <b>Should</b> Just Say <b>No</b>. September 13, 2010 26 <br>\nmin read Download Report. CullyStimson. Charles Stimson &middot; @cullystimson. <br>\nChief of Staff and Senior <b>Legal</b> Fellow. Charles “Cully” Stimson is a widely <br>\nrecognized expert in national security, homeland security, crime control, <b>drug</b> <br>\npolicy &amp;&nbsp;..."]