["... What we&#39;re seeing now is that as <b>automation</b> gets better, a lot of jobs that were <br>\nonce off-shored to low wage countries, especially in areas of repetitive customer <br>\n... You wouldn&#39;t have to work at something you didn&#39;t enjoy, but you would still <br>\nhave income to participate in the <b>economy</b> and help drive <b>economic</b>&nbsp;...", "... <b>Automation</b> is blocking the primary route for poor countries to grow rich. ... <br>\n<b>Automation</b> will end the dream of rapid <b>economic</b> growth for poorer countries ... <br>\nFor poor countries wishing to replicate the path India, Vietnam and China have <br>\ntaken from low income to middle income status this is <b>bad</b> news. There is&nbsp;...", "... Few <b>economic</b> themes capture the attention of the media, politicians, and the <br>\npublic as strongly as the worry that <b>automation</b> threatens employment. ... Second, <br>\nthe concept of job-stealing robots promotes fear of innovation and the false <br>\nnotion that technology may actually be <b>bad for the economy</b>. A member&nbsp;...", "... Artificial Intelligence is a key topic at this year&#39;s World <b>Economic</b> Forum Annual <br>\nMeeting. Watch the Artificial Intelligence session here. Artificial intelligence and <br>\nincreasing <b>automation</b> is going to decimate middle class jobs, worsening <br>\ninequality and risking significant political upheaval, Stephen Hawking has&nbsp;...", "... What determines vulnerability to <b>automation</b>, experts say, is not so much whether <br>\nthe work concerned is manual or white-collar but whether or not it is .... Those <br>\nsounding warnings about technological unemployment “basically ignore the <br>\nissue of the <b>economic</b> response to <b>automation</b>”, says Mr Bessen.", "... The speed of technological improvements today can wipe out broad categories of <br>\njobs faster than the <b>economy</b> can easily absorb and re-focus the blow. ... but what <br>\nit basically says is this: The theory that <b>automation is bad</b> for workers overall is <br>\nalmost always faulty. Sure, specific groups of workers can take it&nbsp;...", "... has fully robotic and <b>automated</b> assembly lines for its electric cars and batteries. <br>\nRobots are even being used in therapy sessions for children. While it is certainly <br>\ntrue that robots are replacing jobs and are a significant threat to low-skilled <br>\nworkers and somewhat of a threat to middle-skilled workers, there are&nbsp;...", "", "... Such anxieties resurfaced in America in the early 1960s, thanks to the rapid <br>\n<b>automation</b> of agriculture, even though the <b>economy</b> was booming. They are <br>\neven more prevalent in the rich world now, as advances in information <br>\ntechnology (IT) threaten jobs that previously seemed invulnerable to <b>automation</b>.", "... All those dire predictions about the <b>automated economy</b> sound like a sci-fi horror <br>\nfilm from the &#39;50s: Robots are coming to take your jobs, your homes, your children<br>\n. Except it&#39;s real. And it has a happy ... The <b>automated</b> gas pump killed a lot of (<br>\n<b>bad</b>) jobs and created many new jobs for more skilled workers.", "... How can an idea favoured by the free-market right form the basis for a “good” <br>\nUtopia of the left? To confront this paradox we need to look into how capitalism <br>\nworks in the present. While robots, <b>automation</b> and the universal basic income <br>\nmay take us beyond work they cannot take us beyond capitalism.", "... If you think Brexit is going to be <b>bad for the economy</b>, just wait until you see <br>\nwhat&#39;s in store for us in 2020. From trade shifting to emerging markets in the East; <br>\njoblessness as a result of <b>automation</b>; ageing populations; and the breaching of <br>\nlocal and global environmental thresholds, we are in for a rocky ride.", "Computers and robots are everywhere, but especially in the manufacturing <br>\nindustry. <b>Automation</b> will certainly change the way people do work, but that doesn<br>\n&#39;t mean that the overall number of jobs will decrease or that the <b>economy</b> will <br>\nsuffer. We can tell you about some of the ways that <b>automation</b> will increase jobs <br>\nand the&nbsp;...", "... For many futurists and <b>economic</b> theorists, the answer is a &quot;basic income,&quot; a <br>\nwage you receive from the government just for being human. The idea isn&#39;t as far-<br>\nfetched as it sounds. Even if you&#39;re not working a blue-collar gig, you could be <br>\naffected, because <b>automation</b> has the potential to damage the job&nbsp;...", "... Written by President Obama&#39;s top <b>economic</b> and science advisors, “Artificial <br>\nIntelligence, <b>Automation</b>, and the <b>Economy</b>” is a clear-eyed look at how .... The <br>\nproblem is that the United States has been particularly <b>bad</b> over the last few <br>\ndecades at helping people who&#39;ve lost out during periods of technological&nbsp;...", "... As the world&#39;s <b>economy</b> rapidly changes, many companies are foregoing <br>\noutsourcing labor and are instead instituting <b>automation</b>. What will the effect be?", "... Is <b>automation</b> all <b>bad</b>? While there will likely be some negative impacts that <br>\naccompany <b>automation</b>, the visible repercussions of <b>automation</b> will not likely <br>\nmanifest as severely as suggested. Despite the extreme criticism of <b>automation</b> <br>\ncoming from naysayers, the <b>economy</b> also stands to greatly benefit from&nbsp;...", "... Although Treasury Secretary Steven Mnuchin said last week he&#39;s &quot;not at all&quot; <br>\nworried about mass unemployment as the U.S. becomes more technologically <br>\nadvanced, a recent study from the National Bureau of <b>Economic</b> Research <br>\nestimates hundreds of thousands of jobs have been sidelined by <b>automation</b>&nbsp;...", "... Ever since the Industrial Revolution, people have worried about machines taking <br>\njobs away from humans. Fears about employment track with every new <br>\ntechnology, from the first <b>automated</b> weaving looms in the 1820s to the dawn of <br>\nthe Internet 20 years ago. But most people would agree that advances&nbsp;...", "The modern <b>economy</b> was built on <b>automation</b>, so it&#39;s natural to assume that the <br>\nfuture will be defined by <b>automation</b> as well. It seems like every week there&#39;s a <br>\nnew study or ... That&#39;s not only <b>bad</b> for the bottom line; it can also inconvenience <br>\ncustomers by creating longer, slower lines. But Starbucks management <br>\nunderstood&nbsp;..."]