["... It is nonsensical to oppose the use of <b>medical marijuana</b> in the midst of what <br>\namounts to a nationwide epidemic of opioid addiction. Why <b>not</b> provide patients <br>\nwith a safer <b>option</b>? And why continue to allow doctors to prescribe powerful, <br>\naddictive opiates but deny them the authority to legally prescribe&nbsp;...", "... CHICAGO — Illinois <b>should not</b> legalize <b>cannabis</b>, and physicians <b>should not</b> <br>\nwrite recommendations for patients to use <b>marijuana</b> for <b>medical</b> purposes, <br>\nbecause it is a dangerous, addictive drug and is <b>not</b> approved by the US Food <br>\nand Drug Administration (FDA), a group of addiction <b>medicine</b> physicians&nbsp;...", "In 1970, the US Congress placed <b>marijuana</b> in Schedule I of the Controlled <br>\nSubstances Act because they considered it to have &quot;<b>no</b> accepted <b>medical</b> use.&quot; <br>\nSince then ... nonprofit website that presents research, studies, and pro and con <br>\nstatements on questions related to whether or <b>not marijuana should</b> be a <b>medical</b> <br>\n<b>option</b>.", "Doctors in some smaller countries are making remarkable discoveries on the <br>\nimportance of <b>medical</b> countries. Among the consumers 50 % said that <b>cannabis</b> <br>\n<b>should</b> be legalized nationwide. The other 50 % are the people who don&#39;t know <br>\nthe actual benefits of <b>medical marijuana</b>. <b>No</b> other medications have the same <br>\nresults&nbsp;...", "Free Essay: Every insurance company is different so are their coverage&#39;s. A <br>\n<b>marijuana</b> consuming patient does <b>not</b> need an individual drug prescription just a<br>\n...", "S. If it was a <b>medical option</b>, than patients would <b>not</b> have to suffer and rely on <br>\nother addictive drugs that are out there. This is a selective drug that <b>can</b> help sick <br>\npatients. Instead of chemical drugs which are expensive and have many side <br>\neffects, one <b>can</b> use <b>marijuana</b> to overcome the hardships of life, find an <br>\nemotional&nbsp;...", "... Making smoked <b>marijuana</b> legal for <b>medical</b> use is <b>not</b> the only <b>option</b> for taking <br>\nadvantage of the <b>medical</b> benefits from <b>marijuana&#39;s</b> active ingredient, .... I think <br>\n<b>medical marijuana</b> is a valid possibility and people <b>should</b> stop arguing with it <br>\nbecause <b>not</b> everyone is going to use it for the wrong reasons. reply.", "... These patients <b>will</b> have that <b>option</b> in Florida. It&#39;s called Charlotte&#39;s Web and the <br>\ngovernor (who I <b>will not</b> be voting for) signed it into law in July. It goes into effect <br>\nJanuary 1st, 2015 and is basically a more regulated form of <b>medical marijuana</b>. Is <br>\nCharlotte&#39;s Web that bad?? As far as Amendment 2 stands now,&nbsp;...", "<b>Should</b> it be a <b>medical option</b>? There are many questions and finding an answer <br>\ncannot happen without properly informing yourself. Read on and find out more <br>\nabout <b>marijuana</b> and its history, as well as about the reasons that make it a good <br>\n<b>option</b> from the <b>medical</b> point of view and the reasons that make it a <b>not</b>-so-good<br>\n&nbsp;...", "... <b>Should marijuana</b> be a <b>medical option</b>? Is a question Colorado along with a <br>\nhandful of other states answered yes too, when passing a legislation clearing it <br>\nfor <b>not</b> only medicinal use but recreational as well. This has stirred a national <br>\ndebate over whether <b>medical marijuana should</b> be used as an alternative&nbsp;...", "... Dr. Sanjay Gupta is a neurosurgeon and CNN&#39;s chief <b>medical</b> correspondent. I <br>\nhave seen more patients like Charlotte first hand, spent time with them and come <br>\nto the realization that it is irresponsible <b>not</b> to provide the best care we <b>can</b> as a <br>\n<b>medical</b> community, care that could involve <b>marijuana</b>. We have&nbsp;...", "Public acceptance rather than clinical data has been the driving force behind the <br>\napproval of <b>medical marijuana</b> in several states. In a survey of family physicians <br>\nconducted in Colorado, for instance, only 46% of 520 respondents believed that <br>\ndoctors <b>should not</b> recommend <b>medical marijuana</b>; however, more than 60% said<br>\n&nbsp;...", "... A majority of doctors say that <b>medical marijuana should</b> be legalized nationally <br>\nand that it <b>can</b> deliver real benefits to patients, a new survey by ... studies <b>can</b> be <br>\ndone to conclusively show where <b>medical marijuana can</b> help and where it might <br>\n<b>not</b>,” says WebMD Chief <b>Medical</b> Editor Michael W. Smith, MD.", "... The federal government&#39;s argument is further asserted to have logical grounding, <br>\nto wit: <b>marijuana</b> is an illegal drug; <b>no</b> one <b>should</b> ever use illegal drugs; <br>\ntherefore, <b>no</b> one <b>should</b> ever use <b>marijuana</b> for any reason [13]. Other <br>\nopponents of the legalization of <b>medical marijuana</b>, such as certain members of&nbsp;...", "... Proponents of <b>marijuana</b>, backed by several studies, say the drug has many <br>\ntherapeutic uses. Opponents — and the U.S. government — however, say it has <br>\na high potential for abuse and <b>no</b> legitimate therapeutic value. <b>Marijuana&#39;s</b> <br>\nmedicinal uses <b>can</b> be traced back as early as 2737 B.C., when the&nbsp;...", "... &quot;In <b>medical marijuana</b> states? I don&#39;t know... I think that states ought to have a <br>\nright to decide these things. I think the federal government&#39;s role in our lives is <br>\nway too-overreaching... But having said that, if you&#39;re in Colorado and you <b>can</b> <br>\npurchase <b>marijuana</b> openly, <b>should</b> people in Wyoming <b>not</b> be&nbsp;...", "... The principal message is that <b>marijuana</b> policy <b>should not</b> be viewed as. <b>Options</b> <br>\nand Issues .... Although <b>no</b> direct evidence supports that belief, one study found <br>\nthat the avail- ability of <b>medical marijuana</b> in Colorado reduced the perceived .... <br>\nBy comparison, <b>options</b> that do <b>not</b> involve creating large-scale.", "... The American <b>Medical</b> Association disagreed, using the same arguments they <br>\nuse today to argue that <b>marijuana</b> shouldn&#39;t be handed out as therapy. They said <br>\nit was <b>not</b> proved to work, that it was <b>not</b> a targeted therapy, that most people who <br>\nasked for it didn&#39;t meet strict criteria and that doctors <b>should not</b>&nbsp;...", "Researchers have admitted that they cannot recommend the use of <b>marijuana</b> to <br>\ntreat* rheumatic diseases, <b>not</b> because they believe that it <b>will</b> be ineffective, but <br>\nsimply because there is <b>not</b> enough studies and data about <b>medical marijuana</b>. <br>\nResearchers have <b>not</b> yet been able to extensively study <b>marijuana</b> and its side&nbsp;...", "... The same percentage said <b>marijuana should</b> be a treatment <b>option</b> for patients, <br>\naccording to the WebMD/Medscape survey. Among consumers, 50 percent said <br>\n<b>medical marijuana should</b> be legalized nationwide, including 49 percent of those <br>\nin states where it is <b>not</b> legal. Forty-five percent said the benefits&nbsp;..."]